app/views/users/index.html.erb

           <%= image_tag i.image.url(:thumb).to_s %>
           <p> Tags: <%= raw i.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %> </p> <br>
---
SELECT `tags`.* FROM `tags` WHERE (lower(name) = 'wtf')