app/controllers/homes_controller.rb

SELECT `homes`.* FROM `homes`
---
  def index
  @home = Home.all