app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
---
def index
@image = Image.all

INSERT INTO `images` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `title`, `updated_at`) VALUES ('2013-12-02 10:18:27', 'image/jpeg', 'apache-sucks.JPG', 127437, '2013-12-02 10:18:26', 'test', '2013-12-02 10:18:27')
---
def create
  @image = Image.new(image_params)
  @image.save

SELECT `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1
---
def show
 @image = Image.find(params[:id])