app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users` JOIN taggings users_taggings_c749b07 ON users_taggings_c749b07.taggable_id = users.id AND users_taggings_c749b07.taggable_type = 'User' AND users_taggings_c749b07.tag_id = 10
SELECT `users`.* FROM `users` JOIN taggings users_taggings_c749b07 ON users_taggings_c749b07.taggable_id = users.id AND users_taggings_c749b07.taggable_type = 'User' AND users_taggings_c749b07.tag_id = 10 ORDER BY `users`.`created_at` DESC LIMIT 5 OFFSET 0
---
  def index
    if params[:tag]
    @user = User.order(created_at: :desc).tagged_with(params[:tag]).page(params[:page]).per(5)

INSERT INTO `users` (`created_at`, `email`, `image`, `text`, `updated_at`) VALUES ('2013-12-03 15:02:07', 'leo@leog.in', 'google-india.jpg', 'test', '2013-12-03 15:02:07')
---
  def create
   @user = User.new(user_params)
   if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1
UPDATE `users` SET `text` = 'RIP English', `updated_at` = '2014-01-06 14:17:41' WHERE `users`.`id` = 13
---
  def update
    @user = User.find(params[:id])

    if @user.update(params[:user].permit(:email,:text, :tag_list))

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC LIMIT 5 OFFSET 0
---
  def admin
    @user = User.order(created_at: :desc).page(params[:page]).per(5)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    @user =  User.find(params[:id])
    @user.delete